000100140113
000109140113
000110140113             CMD        PROMPT('iTrace 2 - Program Catcher')
000111140113
000115140113             PARM       KWD(PROGRAM) TYPE(PGMTOTRACE) PROMPT('Program to trace')
000116140113
000117140113             PARM       KWD(PGMTYPE) TYPE(*CHAR) LEN(10) RSTD(*YES) DFT(*PGM) VALUES(*PGM +
000118140113                          *SRVPGM) CHOICE('*PGM, *SRVPGM') PROMPT('Program Type')
000119140113
000120140113             PARM       KWD(TRACETYPE) TYPE(*CHAR) LEN(10) RSTD(*YES) DFT(*ALL) VALUES(*ALL +
000121140113                          *FLOWCHG *COVERAG) PROMPT('Trace data to save')
000122140113
000123140113             PARM       KWD(OUTFILE) TYPE(OUTF) FILE(*OUT) PROMPT('File to receive output')
000125140113
000126140113             PARM       KWD(OUTFILEOPT) TYPE(*CHAR) LEN(10) VALUES(*ADD *REPLACE) PROMPT('File +
000127140113                          output options') DFT(*ADD) RSTD(*YES)
000128140113
000137140113 PGMTOTRACE: QUAL       TYPE(*NAME) MIN(1) EXPR(*YES)
000138140113             QUAL       TYPE(*NAME) DFT(*LIBL) SPCVAL((*LIBL) (*CURLIB *CURLIB)) +
000139140113                          PROMPT('Library')
000140140113
000141140113 OUTF:       QUAL       TYPE(*NAME) LEN(10) DFT(TRACEDATA) VARY(*NO) EXPR(*YES)
000142140113             QUAL       TYPE(*NAME) LEN(10) DFT(QTEMP) VARY(*NO) EXPR(*YES) SPCVAL((*CURLIB +
000143140113                          *CURLIB)) PROMPT('Library')
